# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
series1 = np.random.randint(1, high=5, size=100)
series1 = pd.DataFrame.from_dict(series1)
series2 = np.random.randint(1, high=4, size=100)
series2 = pd.DataFrame.from_dict(series2)
series3 = np.random.randint(10000, high=30001, size=100)
series3 = pd.DataFrame.from_dict(series3)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([series1, series2, series3], axis=1)
df

    0  0      0
0   2  3  21591
1   3  1  25795
2   2  1  13257
3   3  3  25967
4   1  2  29629
.. .. ..    ...
95  1  1  17946
96  4  3  27553
97  2  2  18244
98  3  3  29347
99  1  1  12545

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       3            21591
1       3       1            25795
2       2       1            13257
3       3       3            25967
4       1       2            29629
..    ...     ...              ...
95      1       1            17946
96      4       3            27553
97      2       2            18244
98      3       3            29347
99      1       1            12545

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = series1.append(series2.append(series3))
bigcolumn

/var/folders/nh/_lkctsl16l393rkzcyztswd80000gn/T/ipykernel_26018/1784063496.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  bigcolumn = series1.append(series2.append(series3))

        0
0       2
1       3
2       2
3       3
4       1
..    ...
95  17946
96  27553
97  18244
98  29347
99  12545

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
bigcolumn.reset_index()

     index      0
0        0      2
1        1      3
2        2      2
3        3      3
4        4      1
..     ...    ...
295     95  17946
296     96  27553
297     97  18244
298     98  29347
299     99  12545

[300 rows x 2 columns]